app/Controllers/Auth.php

SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `ip_address` = '::1'
AND `attempt_time` >= '2025-04-21 04:37:06'
---
    public function auth()
    {
        $session = session();
        $model = new UserModel();
        $db = \Config\Database::connect();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $ip = $this->request->getIPAddress();

        $maxAttempts = 5;
        $lockoutTime = 3 * 60; // 1 minute lockout time (in seconds)
        $timeWindow = date('Y-m-d H:i:s', strtotime('-15 minutes'));

        // Count recent failed attempts
        $builder = $db->table('login_attempts');
        $attempts = $builder
            ->where('ip_address', $ip)
            ->where('attempt_time >=', $timeWindow)
            ->countAllResults();

DELETE FROM `login_attempts`
WHERE `ip_address` = '::1'
AND `attempt_time` < '2025-04-21 04:42:52'
---
    private function clearFailedAttempts()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('login_attempts');

        $ip = $this->request->getIPAddress();

        // Delete records based on the IP address and older than the lockout period
        $timeThreshold = date('Y-m-d H:i:s', strtotime('-1 minute')); // 1 minute ago

        // Delete only records older than the threshold for this IP address
        $builder->where('ip_address', $ip)
                ->where('attempt_time <', $timeThreshold)
                ->delete();