app/Controllers/Users.php

    public function index(){
        $model = new UserModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`

    public function update(){
    $model = new UserModel();
    $userId = $this->request->getPost('id');
    $name = $this->request->getPost('name');
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');
    $role = $this->request->getPost('role');
    $status = $this->request->getPost('status');
    $phone = $this->request->getPost('phone');

    // Validate the input
    if (empty($email)) {
        return $this->response->setJSON(['success' => false, 'message' => 'Email is required']);
    }

    // Check if email already exists for another user
    $existingUser = $model->where('email', $email)
                          ->where('id !=', $userId)
                          ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'glennazuelo1@gmail.com'
AND `id` != '1'
 LIMIT 1

        $userData['password'] = password_hash($password, PASSWORD_BCRYPT);
    }

    $updated = $model->update($userId, $userData);
---
UPDATE `users` SET `name` = 'Glenn Azuelo', `email` = 'glennazuelo1@gmail.com', `role` = 'User', `status` = 'Active', `phone` = '09125110476', `updated_at` = '2025-04-23 08:18:40', `deleted_at` = '2025-04-23 08:18:40'
WHERE `users`.`id` IN ('1')

public function edit($id){
    $model = new UserModel();
    $user = $model->find($id); // Fetch user by ID
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

public function fetchUsers(){
    $model = new UserModel();
    $users = $model->findAll();
---
SELECT *
FROM `users`